<a href="https://colab.research.google.com/github/IM-RAHUL-RAJ/py_pandas_datascience/blob/main/pandas2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("/business-price-indexes-september-2020-quarter-corrections-to-previously-published-statistics.csv")

In [5]:
df

   Series reference  ... Revised
0    PPIQ.SQU900000  ...    1184
1    PPIQ.SQU900001  ...    1181
2    PPIQ.SQUC76745  ...    1603
3    PPIQ.SQUCC3100  ...    1170
4    PPIQ.SQUCC3110  ...    1170
..              ...  ...     ...
73   PPIQ.SQNMN2100  ...    1195
74   PPIQ.SQNRS211X  ...    1127
75       FPIQ.SEC14  ...    1120
76       FPIQ.SEC99  ...    1068
77       FPIQ.SEH14  ...    1110

[78 rows x 5 columns]

In [6]:
df.shape   #tuple

(78, 5)

In [7]:
rows,columns=df.shape

In [8]:
rows

78

In [9]:
df.tail

<bound method NDFrame.tail of    Series reference  ... Revised
0    PPIQ.SQU900000  ...    1184
1    PPIQ.SQU900001  ...    1181
2    PPIQ.SQUC76745  ...    1603
3    PPIQ.SQUCC3100  ...    1170
4    PPIQ.SQUCC3110  ...    1170
..              ...  ...     ...
73   PPIQ.SQNMN2100  ...    1195
74   PPIQ.SQNRS211X  ...    1127
75       FPIQ.SEC14  ...    1120
76       FPIQ.SEC99  ...    1068
77       FPIQ.SEH14  ...    1110

[78 rows x 5 columns]>

In [10]:
df.head

<bound method NDFrame.head of    Series reference  ... Revised
0    PPIQ.SQU900000  ...    1184
1    PPIQ.SQU900001  ...    1181
2    PPIQ.SQUC76745  ...    1603
3    PPIQ.SQUCC3100  ...    1170
4    PPIQ.SQUCC3110  ...    1170
..              ...  ...     ...
73   PPIQ.SQNMN2100  ...    1195
74   PPIQ.SQNRS211X  ...    1127
75       FPIQ.SEC14  ...    1120
76       FPIQ.SEC99  ...    1068
77       FPIQ.SEH14  ...    1110

[78 rows x 5 columns]>

In [11]:
df.head()

  Series reference  ... Revised
0   PPIQ.SQU900000  ...    1184
1   PPIQ.SQU900001  ...    1181
2   PPIQ.SQUC76745  ...    1603
3   PPIQ.SQUCC3100  ...    1170
4   PPIQ.SQUCC3110  ...    1170

[5 rows x 5 columns]

In [12]:
df.tail()

   Series reference  ... Revised
73   PPIQ.SQNMN2100  ...    1195
74   PPIQ.SQNRS211X  ...    1127
75       FPIQ.SEC14  ...    1120
76       FPIQ.SEC99  ...    1068
77       FPIQ.SEH14  ...    1110

[5 rows x 5 columns]

In [13]:
df.head(2)

  Series reference  ... Revised
0   PPIQ.SQU900000  ...    1184
1   PPIQ.SQU900001  ...    1181

[2 rows x 5 columns]

In [14]:
df[2:5]

  Series reference  ... Revised
2   PPIQ.SQUC76745  ...    1603
3   PPIQ.SQUCC3100  ...    1170
4   PPIQ.SQUCC3110  ...    1170

[3 rows x 5 columns]

In [15]:
df[:]

   Series reference  ... Revised
0    PPIQ.SQU900000  ...    1184
1    PPIQ.SQU900001  ...    1181
2    PPIQ.SQUC76745  ...    1603
3    PPIQ.SQUCC3100  ...    1170
4    PPIQ.SQUCC3110  ...    1170
..              ...  ...     ...
73   PPIQ.SQNMN2100  ...    1195
74   PPIQ.SQNRS211X  ...    1127
75       FPIQ.SEC14  ...    1120
76       FPIQ.SEC99  ...    1068
77       FPIQ.SEH14  ...    1110

[78 rows x 5 columns]

In [16]:
df.columns

Index(['Series reference', 'Description', 'Period', 'Previously published',
       'Revised'],
      dtype='object')

In [17]:

df.price

AttributeError: ignored

In [18]:
df.Description

0                    PPI output index - All industries
1            PPI output index - All industries excl OOD
2     PPI published output commodity - Transport sup...
3     PPI output index level 3 - Wood product manufa...
4     PPI output index level 4 - Wood product manufa...
                            ...
73    PPI input index level 3 - Administrative and s...
74       PPI input index level 4 - Repair & maintenance
75    Farm expenses price index - Dairy farms - Freight
76    Farm expenses price index - Dairy farms - All ...
77      Farm expenses price index - All farms - Freight
Name: Description, Length: 78, dtype: object

In [19]:
df['description']

KeyError: ignored

In [20]:
df['Description'']

SyntaxError: ignored

In [21]:
df['Description']

0                    PPI output index - All industries
1            PPI output index - All industries excl OOD
2     PPI published output commodity - Transport sup...
3     PPI output index level 3 - Wood product manufa...
4     PPI output index level 4 - Wood product manufa...
                            ...
73    PPI input index level 3 - Administrative and s...
74       PPI input index level 4 - Repair & maintenance
75    Farm expenses price index - Dairy farms - Freight
76    Farm expenses price index - Dairy farms - All ...
77      Farm expenses price index - All farms - Freight
Name: Description, Length: 78, dtype: object

In [22]:
df['Description','Period']

KeyError: ignored

In [23]:
df['Description'].min()

'Farm expenses price index - All farms - Freight'

In [24]:
df.describe()

             Period  Previously published      Revised
count  7.800000e+01             78.000000    78.000000
mean   2.020060e+03           1157.256410  1165.589744
std    1.601918e-12             82.629581   100.669633
min    2.020060e+03            903.000000   904.000000
25%    2.020060e+03           1124.500000  1126.250000
50%    2.020060e+03           1151.500000  1153.000000
75%    2.020060e+03           1192.750000  1194.250000
max    2.020060e+03           1415.000000  1603.000000

In [2]:
import pandas as pd
df2=pd.read_csv('/content/Book1.csv')

In [3]:
df2

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    35          7  sunny
2  01-03-2017    28          2   snow
3  01-04-2017    24          7   snow
4  01-05-2017    32          4   rain
5  01-06-2017    32          2  sunny

In [4]:
df2.describe

<bound method NDFrame.describe of           day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    35          7  sunny
2  01-03-2017    28          2   snow
3  01-04-2017    24          7   snow
4  01-05-2017    32          4   rain
5  01-06-2017    32          2  sunny>

In [5]:
df2.describe()

            temp  windspeed
count   6.000000   6.000000
mean   30.500000   4.666667
std     3.885872   2.338090
min    24.000000   2.000000
25%    29.000000   2.500000
50%    32.000000   5.000000
75%    32.000000   6.750000
max    35.000000   7.000000

In [6]:
df2.max()

day          01-06-2017
temp                 35
windspeed             7
event             sunny
dtype: object

In [7]:
df2

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    35          7  sunny
2  01-03-2017    28          2   snow
3  01-04-2017    24          7   snow
4  01-05-2017    32          4   rain
5  01-06-2017    32          2  sunny

In [8]:
df2[df2['temp']>30]

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    35          7  sunny
4  01-05-2017    32          4   rain
5  01-06-2017    32          2  sunny

In [9]:
df2[df2.temp==df2['temp'].max()]

          day  temp  windspeed  event
1  01-02-2017    35          7  sunny

In [10]:
df2['day'][df2.temp==df2['temp'].max()]

1    01-02-2017
Name: day, dtype: object

In [13]:
df2[['day','temp']][df2.temp==df2['temp'].max()]

          day  temp
1  01-02-2017    35

In [14]:
df2

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    35          7  sunny
2  01-03-2017    28          2   snow
3  01-04-2017    24          7   snow
4  01-05-2017    32          4   rain
5  01-06-2017    32          2  sunny

In [16]:
df2.set_index('day')

            temp  windspeed  event
day
01-01-2017    32          6   rain
01-02-2017    35          7  sunny
01-03-2017    28          2   snow
01-04-2017    24          7   snow
01-05-2017    32          4   rain
01-06-2017    32          2  sunny

In [17]:
df2

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    35          7  sunny
2  01-03-2017    28          2   snow
3  01-04-2017    24          7   snow
4  01-05-2017    32          4   rain
5  01-06-2017    32          2  sunny

In [18]:
df2.set_index('day',inplace=True)

In [19]:
df2

            temp  windspeed  event
day
01-01-2017    32          6   rain
01-02-2017    35          7  sunny
01-03-2017    28          2   snow
01-04-2017    24          7   snow
01-05-2017    32          4   rain
01-06-2017    32          2  sunny

In [20]:
df2.reset_index(inplace=True)

In [21]:
df2

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    35          7  sunny
2  01-03-2017    28          2   snow
3  01-04-2017    24          7   snow
4  01-05-2017    32          4   rain
5  01-06-2017    32          2  sunny

In [22]:
df2.loc['2']

KeyError: ignored

In [23]:
df2.loc[2]

day          01-03-2017
temp                 28
windspeed             2
event              snow
Name: 2, dtype: object

***differebt ways of creating dataframe***
**bold text**

In [24]:
import pandas as pd

In [25]:
df3=pd.read_excel('/content/Book1.xlsx','Sheet1')

In [26]:
df3

         day  temp  windspeed  event
0 2017-01-01    32          6   rain
1 2017-02-01    35          7  sunny
2 2017-03-01    28          2   snow
3 2017-04-01    24          7   snow
4 2017-05-01    32          4   rain
5 2017-06-01    32          2  sunny

***covert to NAN***

In [39]:
pd4=pd.read_excel('/content/Book3.xlsx',na_values={'eps':[-1],
                                                   'revenue':[-1]}
                  )

In [40]:
pd4

  tickers    eps  revenue   price      people
0  GOOGLE  27.82       87   845.0  LARRY PAGE
1     WMT   4.61      484    64.0         NaN
2    MSFT    NaN       65    65.0  BILL GATES
3    BHEL    NaN       50  1023.0      MUKESH
4    TATA   5.00       -1     NaN  RATAN TATA

In [41]:
pd4.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [48]:
def convert(cell):
  if cell==-1:
    return 'very low'
  return cell

pd4=pd.read_excel("/content/Book3.xlsx","Sheet1",converters={
    'revenue':convert
})    
pd4

  tickers    eps   revenue   price      people
0  GOOGLE  27.82        87   845.0  LARRY PAGE
1     WMT   4.61       484    64.0         NaN
2    MSFT  -1.00        65    65.0  BILL GATES
3    BHEL    NaN        50  1023.0      MUKESH
4    TATA   5.00  very low     NaN  RATAN TATA

***handle missing data***

In [45]:
import pandas as pd

In [46]:
pd4.fillna(0.0)

  tickers    eps   revenue   price      people
0  GOOGLE  27.82        87   845.0  LARRY PAGE
1     WMT   4.61       484    64.0           0
2    MSFT  -1.00        65    65.0  BILL GATES
3    BHEL   0.00        50  1023.0      MUKESH
4    TATA   5.00  very low     0.0  RATAN TATA

In [52]:
#add avrg values
pd4.fillna({'price':10,
            'eps':10})

  tickers    eps   revenue   price      people
0  GOOGLE  27.82        87   845.0  LARRY PAGE
1     WMT   4.61       484    64.0         NaN
2    MSFT  -1.00        65    65.0  BILL GATES
3    BHEL  10.00        50  1023.0      MUKESH
4    TATA   5.00  very low    10.0  RATAN TATA

In [53]:
newdf=pd4.fillna(method="ffill")

In [54]:
newdf

  tickers    eps   revenue   price      people
0  GOOGLE  27.82        87   845.0  LARRY PAGE
1     WMT   4.61       484    64.0  LARRY PAGE
2    MSFT  -1.00        65    65.0  BILL GATES
3    BHEL  -1.00        50  1023.0      MUKESH
4    TATA   5.00  very low  1023.0  RATAN TATA

In [57]:
newdf=pd4.fillna(method="bfill")

In [58]:
newdf

  tickers    eps   revenue   price      people
0  GOOGLE  27.82        87   845.0  LARRY PAGE
1     WMT   4.61       484    64.0  BILL GATES
2    MSFT  -1.00        65    65.0  BILL GATES
3    BHEL   5.00        50  1023.0      MUKESH
4    TATA   5.00  very low     NaN  RATAN TATA

In [59]:
newdf=pd4.fillna(method='ffill',axis="columns")

In [60]:
newdf

  tickers    eps   revenue     price      people
0  GOOGLE  27.82        87       845  LARRY PAGE
1     WMT   4.61       484        64          64
2    MSFT     -1        65        65  BILL GATES
3    BHEL   BHEL        50      1023      MUKESH
4    TATA      5  very low  very low  RATAN TATA

In [61]:
pd4.interpolate

<bound method NDFrame.interpolate of   tickers    eps   revenue   price      people
0  GOOGLE  27.82        87   845.0  LARRY PAGE
1     WMT   4.61       484    64.0         NaN
2    MSFT  -1.00        65    65.0  BILL GATES
3    BHEL    NaN        50  1023.0      MUKESH
4    TATA   5.00  very low     NaN  RATAN TATA>

In [62]:
pd4

  tickers    eps   revenue   price      people
0  GOOGLE  27.82        87   845.0  LARRY PAGE
1     WMT   4.61       484    64.0         NaN
2    MSFT  -1.00        65    65.0  BILL GATES
3    BHEL    NaN        50  1023.0      MUKESH
4    TATA   5.00  very low     NaN  RATAN TATA

In [64]:
pd4.interpolate()  #some avrg values by default linear interpolation

  tickers    eps   revenue   price      people
0  GOOGLE  27.82        87   845.0  LARRY PAGE
1     WMT   4.61       484    64.0         NaN
2    MSFT  -1.00        65    65.0  BILL GATES
3    BHEL   2.00        50  1023.0      MUKESH
4    TATA   5.00  very low  1023.0  RATAN TATA

In [65]:
pd4['revenue']

0          87
1         484
2          65
3          50
4    very low
Name: revenue, dtype: object

In [66]:
pd4['revenue'][4]

'very low'

In [67]:
pd4['revenue'][4]=20

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [68]:
pd4

  tickers    eps revenue   price      people
0  GOOGLE  27.82      87   845.0  LARRY PAGE
1     WMT   4.61     484    64.0         NaN
2    MSFT  -1.00      65    65.0  BILL GATES
3    BHEL    NaN      50  1023.0      MUKESH
4    TATA   5.00      20     NaN  RATAN TATA

In [69]:
pd4.dropna(how="all")

  tickers    eps revenue   price      people
0  GOOGLE  27.82      87   845.0  LARRY PAGE
1     WMT   4.61     484    64.0         NaN
2    MSFT  -1.00      65    65.0  BILL GATES
3    BHEL    NaN      50  1023.0      MUKESH
4    TATA   5.00      20     NaN  RATAN TATA

In [70]:
pd4.dropna(thresh=1)

  tickers    eps revenue   price      people
0  GOOGLE  27.82      87   845.0  LARRY PAGE
1     WMT   4.61     484    64.0         NaN
2    MSFT  -1.00      65    65.0  BILL GATES
3    BHEL    NaN      50  1023.0      MUKESH
4    TATA   5.00      20     NaN  RATAN TATA